# Brewfile
# Autor: Wendell Borges [perlporter@gmail.com]
# Data: 30/12/2020

# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "muesli/tap"

# packages
brew "ansible"					# 
brew "bat"						# cat alternative
brew "bpytop"					# top alternative
brew "cloc"						# count code lines
brew "curl"						# transfer a URL
brew "duf"						# df alternative
brew "dos2unix" 				# convert file DOS to unix
brew "esptool"
brew "ffmpeg"					# video converter
brew "fortune"					# print a random quotes
brew "git"						# newer version of Git
brew "gnupg"					# 
brew "grep"						# GNU grep - ggrep
brew "htop"						# top alternative
brew "lazydocker"				#
brew "lazygit"					#
brew "lsd"						# ls alternative
brew "mas"						# install apps Mac App Store
brew "neofetch"					# command-line system information
brew "noti"						# trigger a notification
brew "node"						#
brew "python"					#
brew "pyenv"					#
brew "pyenv-virtualenv"			#
brew "platformio"
brew "shellcheck"				# Shell script analysis tool
brew "speedtest-cli"			# testing internet bandwidth
brew "telnet"					# user interface TELNET protocol
brew "thefuck"					#	
brew "tmux"						# terminal multiplexer
brew "tree"						# lists contents in a tree-like format
brew "vim"						# Vi IMproved
brew "wget"						# the nono-interactive network downloader
brew "youtube-dl"				# downlod videos from youtube or other platforms
brew "xz"						# compress or decompress .xz files
brew "zsh"						# newer version of ZSH
brew "zsh-syntax-highlighting"	#

# casks
cask "audio-hijack" 
cask "alfred"
cask "anydesk"
cask "backblaze"  ## NOT INSTALL
cask "balenaetcher"
cask "bartender"
cask "deepl"
cask "discord"
cask "docker"
cask "iterm2"
cask "intel-power-gadget"   ## NEEDS PASSWORD
cask "istat-menus"
cask "gemini"
cask "keycastr"
cask "raspberry-pi-imager"
cask "minecraft"
cask "mpv"
cask "netspot"
cask "wireshark"
cask "viscosity"
cask "transmission"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-3270-nerd-font"
cask "font-hack-nerd-font"
cask "texpad"
cask "mactex-no-gui"   ## NEEDS PASSWORD
cask "xscreensaver"

# macOS App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "1Password 7", id: 1333542190
mas "PopClip", id: 445189367
mas "1Blocker", id: 1107421413
mas "Evernote", id: 406056744
mas "Evernote Web Clipper", id: 1481669779
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "DaisyDisk", id: 411643860
mas "The Unarchiver", id: 425424353
mas "FruitJuice", id: 671736912
mas "Telegram", id: 747648890
mas "Mactracker", id: 430255202
